Revit 2024 API
BuiltInFailures.LegendFailures Class
 Failures about Legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class LegendFailures
Visual Basic
Public NotInheritable Class LegendFailures
Visual C++
public ref class LegendFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.LegendFailures
See Also
BuiltInFailures.LegendFailures Members
Autodesk.Revit.DB Namespace